#+BEGIN_SRC emacs-lisp :exports none :results silent
  (setq org-babel-inline-result-wrap "\\(%s\\)")
#+END_SRC

After this long, conceptual introduction, let us finally get to "the meat" and apply the procedure to a real data set with Python and =PyMC=.
This requires me to gradually present the data which was acquired by François and colleagues, and what I made of it.

#+BEGIN_SRC python :results output :session analysisdata :exports none
import os as OS
OS.chdir(OS.read(OS.open('homedir.txt', OS.O_RDONLY), 1000).strip())
import numpy as NP
import pandas as PD

n_iterations = 16384
fi = f'models/proportions/bodyproportions_{n_iterations}_data.csv'
# import os as OS
# print (OS.system('pwd'))
# print (OS.path.exists(fi))

subject_data = PD.read_csv(fi, sep = ';').set_index('Unnamed: 0', inplace = False)
subject_data.index.name = 'idx'
# print (subject_data.head(3).T)

stride_data = PD.read_csv('data/analysis_all.csv', sep = ';')
stride_data.index.name = 'idx'
# print (stride_data.head(3).T)

#+END_SRC

#+RESULTS:

** Stride Parameter PCA
:PROPERTIES:
:CUSTOM_ID: prep:stridepca
:END:
It turned out that some of the models (namely the more complex ones involving posture and coordination) did not sample well when all the stride parameters listed above were included as predictors.
However, a strong correlation between some of them is expected and confirmed by calculation.
Therefore, a useful trick to enable sampling for the complex models is a dimensionality reduction via principal component analysis (PCA).

#+BEGIN_SRC emacs-lisp :exports none :results silent
  (setq org-babel-inline-result-wrap "\\(%s\\)")
#+END_SRC

#+BEGIN_SRC python :results output :session stridepca :exports none :tangle yes
import os as OS
OS.chdir(OS.read(OS.open('homedir.txt', OS.O_RDONLY), 1000).strip())
import sys as SYS
import numpy as NP

SYS.path.append('../toolboxes')
import EigenToolbox as ET

stride_pca = ET.PrincipalComponentAnalysis.Load('data/stride_parameters.pca')

cum_weight = NP.cumsum(stride_pca.weights).round(3)*100
print (cum_weight)

#+END_SRC

#+RESULTS:
: [ 69.1  99.8 100. ]


A PCA of stride distance, stride frequency, and speed (all dimensionless) was performed (Tab. \ref{tab:stridepca}).
The three input parameters were standardized so that they equally contribute to the components.
The first two principal components capture src_python[:session stridepca]{f'{cum_weight[1]:.1f} \%'} {{{results(\(99.8 \%\))}}} of the variance, justifying an optional reduction to two parameters via PCA transformation.
PCA space is orthogonal, i.e. there is no correlation between the principal components (thus we do not have to model a multivariate predictor block).
This means that PCA can be favorable for sampling even if dimensionality is retained.
The inverse transformation allows to convert predicted PC values back to the original parameters.
\bigskip

#+CAPTION: Stride Parameter PCA: variance covered (%) and eigenvector loadings.
#+LABEL: tab:stridepca
#+INCLUDE: "../results/stride_pca.org"

#+BEGIN_COMMENT
#+ATTR_LATEX: :placement [Hb]
#+END_COMMENT
